tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

brew "readline"
brew "sqlite"
brew "xz"
brew "awscli"
brew "bat"
brew "direnv"
brew "fish"
brew "fzf"
brew "graphviz"
brew "neovim"
brew "node"
brew "openssl@3"
brew "pgcli"
brew "postgresql"
brew "pyenv"
brew "ripgrep"
brew "starship"
brew "stow"
brew "syncthing"
brew "zlib"

cask "amethyst"
cask "dbeaver-community"
cask "discord"
cask "docker"
cask "flycut"
cask "font-hack-nerd-font"
cask "font-inconsolata"
cask "font-inconsolata-nerd-font"
cask "gnucash"
cask "insomnia"
cask "iterm2"
cask "karabiner-elements"
cask "keepassxc"
cask "strawberry"
cask "telegram"
