tap "armmbed/formulae"
tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "koekeishiya/formulae"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "probe-rs/probe-rs"
tap "qmk/qmk"
# General-purpose data compression with high compression ratio
brew "xz"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Next generation open source RPC library and framework
brew "grpc"
# Columnar in-memory analytics layer designed to accelerate big data
brew "apache-arrow"
# Collection of portable C++ source libraries
brew "boost"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Text-based UI library
brew "ncurses"
# Console Bonsai is a bonsai tree generator, written in C using ncurses
brew "cbonsai"
# Object-file caching compiler wrapper
brew "ccache"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# Linux virtual machines
brew "lima"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# GNU File, Shell, and Text utilities
brew "coreutils"
# USB programmer
brew "dfu-util"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-buildx"
# Isolated development environments using Docker
brew "docker-compose"
# Platform keystore credential helper for Docker
brew "docker-credential-helper"
# Docker Credential Helper for Amazon ECR
brew "docker-credential-helper-ecr"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Light HTTP/1.1 server library
brew "libmicrohttpd"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Library for encoding and decoding .avif files
brew "libavif"
# GitHub command-line tool
brew "gh"
# Git extension for versioning large files
brew "git-lfs"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Image manipulation
brew "netpbm"
# GNU triangulated surface library
brew "gts"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Ranger-like terminal file manager written in Rust
brew "joshuto"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Network authentication protocol
brew "krb5"
# Simple terminal UI for git commands
brew "lazygit"
# Implementation of the file(1) command
brew "libmagic"
# LLVM's OpenMP runtime library
brew "libomp"
# Package manager for the Lua programming language
brew "luarocks"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# On-chip debugging, in-system programming and boundary-scan testing
brew "open-ocd"
# Swiss-army knife of markup format conversion
brew "pandoc"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Friendly PIL fork (Python Imaging Library)
brew "pillow"
# Draw UML diagrams
brew "plantuml"
# Object-relational database system
brew "postgresql@14"
# Generic machine emulator and virtualizer
brew "qemu"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Open source continuous file synchronization application
brew "syncthing"
# User interface to the TELNET protocol
brew "telnet"
# Build, bundle & ship your Rust WASM application to the web
brew "trunk"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Your CLI home video recorder
brew "vhs"
# General-purpose lossless data-compression library
brew "zlib"
# Fast static site generator in a single binary with everything built-in
brew "zola"
brew "armmbed/formulae/arm-none-eabi-gcc"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# Terraform
brew "hashicorp/tap/terraform"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# A collection of on chip debugging tools to communicate with microchips.
brew "probe-rs/probe-rs/probe-rs"
# Quantum Mechanical Keyboard (QMK) Firmware
brew "qmk/qmk/qmk"
# E-books management software
cask "calibre"
# Universal database tool and SQL client
cask "dbeaver-community"
# Digital photo manager
cask "digikam"
# API documentation viewer
cask "dteoh-devdocs"
# Clipboard manager for developers
cask "flycut"
cask "font-hack-nerd-font"
cask "font-inconsolata"
cask "font-inconsolata-nerd-font"
# Free and open-source image editor
cask "gimp"
# Double-entry accounting program
cask "gnucash"
# Graphically shows disk usage within a file system
cask "grandperspective"
# Tool to optimise images to a smaller size
cask "imageoptim"
# Password manager app
cask "keepassxc"
# CAD application
cask "librecad"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Toolbox companion for QMK Firmware
cask "qmk-toolbox"
# Run commands and display their output on the desktop
cask "ubersicht"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Gecko based web browser
cask "zen-browser"
